app/views/courses/participants_status.html.erb

SELECT `participants`.* FROM `participants` WHERE (`participants`.activity_id = 1)
---
  </tr>
<% @participants[:participants].each do |info| %>