app/controllers/activities_controller.rb

  def new
    @course = Course.find(params[:course_id])
---
SELECT `courses`.* FROM `courses` WHERE `courses`.`id` = 1 LIMIT 1

  def edit
    @course = Course.find(params[:course_id])
    @activity = Activity.find(params[:id])
    20.times { @activity.participants.build }
    @participants = Participant.find_all_by_activity_id(@activity.id)
---
SELECT `courses`.* FROM `courses` WHERE `courses`.`id` = 1 LIMIT 1
SELECT `activities`.* FROM `activities` WHERE `activities`.`id` = 1 LIMIT 1
SELECT `participants`.* FROM `participants` WHERE `participants`.`activity_id` = 1

  def create
    @course = Course.find(params[:course_id])
    @activity = @course.activities.build(params[:activity])
    respond_to do |format|
      if @activity.save
---
SELECT `courses`.* FROM `courses` WHERE `courses`.`id` = 1 LIMIT 1
INSERT INTO `activities` (`updated_at`, `created_at`, `start_time`, `course_id`, `leader`, `end_time`, `place`, `name`, `date`) VALUES ('2011-03-25 14:34:17', '2011-03-25 14:34:17', '2011-03-25 14:33:00', 1, 'teste', '2011-03-25 14:33:00', 'teste', 'teste', '2011-03-25')

  def update
    @activity = Activity.find(params[:id])

    respond_to do |format|
      if @activity.update_attributes(params[:activity])
---
SELECT `activities`.* FROM `activities` WHERE `activities`.`id` = 1 LIMIT 1
UPDATE `activities` SET `name` = 'p', `updated_at` = '2011-03-29 23:49:10' WHERE `activities`.`id` = 1