app/controllers/courses_controller.rb

SELECT `activities`.* FROM `activities` WHERE (`activities`.course_id = 1)
SELECT `courses`.* FROM `courses` WHERE `courses`.`id` = 1 LIMIT 1
---
  def show
    @course = Course.find(params[:id], :include => [ :activities ])

SELECT `courses`.* FROM `courses` WHERE `courses`.`id` = 1 LIMIT 1
---
  def edit
    @course = Course.find(params[:id])

INSERT INTO `courses` (`identifier`, `description`, `updated_at`, `created_at`) VALUES ('teste', NULL, '2011-03-25 14:33:51', '2011-03-25 14:33:51')
---
  def create
    @course = Course.new(params[:course])

    respond_to do |format|
      if @course.save

SELECT `courses`.* FROM `courses` WHERE `courses`.`id` = 1 LIMIT 1
---
  def update
    @course = Course.find(params[:id])

SELECT `courses`.* FROM `courses` WHERE `courses`.`id` = 1 LIMIT 1
SELECT `participants`.* FROM `participants` WHERE (`participants`.activity_id = 1)
---
  def participants_status
    @participants = Course.find(params[:id]).participants_info